{
  "stations": [
    "القاهرة", "الجيزة", "الإسكندرية", "سيدي جابر", "بنها", "قليوب", "قويسنا", "بركة السبع", "طنطا", "كفر الزيات", "إيتاي البارود", "دمنهور", "أبو حمص", "كفر الدوار",
    "بني سويف", "الواسطي", "ببا", "الفشن", "مغاغة", "بني مزار", "مطاي", "سمالوط", "المنيا", "أبو قرقاص", "ملوي", "ديرمواس", "ديروط", "القوصية", "منفلوط", "أسيوط", "أبو تيج", "صدفا", "طما", "طهطا", "المراغة", "سوهاج", "المنشأة", "جرجا", "البلينا", "أبو تشت", "فرشوط", "نجع حمادي", "دشنا", "قنا", "قفط", "قوص", "الأقصر", "إسنا", "إدفو", "كلابشة", "كوم أمبو", "دراو", "أسوان",
    "الزقازيق", "أبو حماد", "الإسماعيلية", "القنطرة غرب", "بورسعيد", "السويس", "أبو كبير", "فاقوس", "الصالحية", "المنصورة", "طلخا", "شربين", "دمياط", "المحلة الكبرى", "كفر الشيخ", "دسوق", "قلين", "بيلا", "مرسى مطروح", "الفيوم"
  ],
  "trains": [
    {"id": "2025", "from": "القاهرة", "to": "الإسكندرية", "dep": "08:00 ص", "type": "تالجو", "price": "275 ج"},
    {"id": "2030", "from": "القاهرة", "to": "أسوان", "dep": "07:00 م", "type": "تالجو", "price": "700 ج"},
    {"id": "980", "from": "القاهرة", "to": "أسوان", "dep": "08:00 ص", "type": "VIP", "price": "350 ج"},
    {"id": "901", "from": "القاهرة", "to": "الإسكندرية", "dep": "08:10 ص", "type": "VIP", "price": "145 ج"},
    {"id": "164", "from": "المنيا", "to": "القاهرة", "dep": "03:40 م", "type": "روسي", "price": "55 ج"},
    {"id": "2006", "from": "القاهرة", "to": "أسيوط", "dep": "05:15 م", "type": "VIP", "price": "195 ج"}
  ]
}
